Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(256, 16000)]       0                                            
__________________________________________________________________________________________________
speech_features (SpeechFeatures (256, 98, 40)        0           input_1[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_ExpandDims (TensorF [(256, 98, 1, 40)]   0           speech_features[0][0]            
__________________________________________________________________________________________________
stream (Stream)                 (256, 98, 1, 40)     440         tf_op_layer_ExpandDims[0][0]     
__________________________________________________________________________________________________
conv2d (Conv2D)                 (256, 98, 1, 128)    5120        stream[0][0]                     
__________________________________________________________________________________________________
batch_normalization (BatchNorma (256, 98, 1, 128)    512         conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (256, 98, 1, 128)    0           batch_normalization[0][0]        
__________________________________________________________________________________________________
dropout (Dropout)               (256, 98, 1, 128)    0           activation[0][0]                 
__________________________________________________________________________________________________
stream_1 (Stream)               (256, 98, 1, 128)    1664        dropout[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (256, 98, 1, 64)     8192        stream_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (256, 98, 1, 64)     8192        dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (256, 98, 1, 64)     256         conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (256, 98, 1, 64)     256         conv2d_2[0][0]                   
__________________________________________________________________________________________________
add (Add)                       (256, 98, 1, 64)     0           batch_normalization_1[0][0]      
                                                                 batch_normalization_2[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (256, 98, 1, 64)     0           add[0][0]                        
__________________________________________________________________________________________________
dropout_1 (Dropout)             (256, 98, 1, 64)     0           activation_1[0][0]               
__________________________________________________________________________________________________
stream_2 (Stream)               (256, 98, 1, 64)     960         dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (256, 98, 1, 64)     4096        stream_2[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (256, 98, 1, 64)     4096        dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (256, 98, 1, 64)     256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (256, 98, 1, 64)     256         conv2d_4[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (256, 98, 1, 64)     0           batch_normalization_3[0][0]      
                                                                 batch_normalization_4[0][0]      
__________________________________________________________________________________________________
activation_2 (Activation)       (256, 98, 1, 64)     0           add_1[0][0]                      
__________________________________________________________________________________________________
dropout_2 (Dropout)             (256, 98, 1, 64)     0           activation_2[0][0]               
__________________________________________________________________________________________________
stream_3 (Stream)               (256, 98, 1, 64)     1088        dropout_2[0][0]                  
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (256, 98, 1, 64)     4096        stream_3[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (256, 98, 1, 64)     4096        dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (256, 98, 1, 64)     256         conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (256, 98, 1, 64)     256         conv2d_6[0][0]                   
__________________________________________________________________________________________________
add_2 (Add)                     (256, 98, 1, 64)     0           batch_normalization_5[0][0]      
                                                                 batch_normalization_6[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (256, 98, 1, 64)     0           add_2[0][0]                      
__________________________________________________________________________________________________
dropout_3 (Dropout)             (256, 98, 1, 64)     0           activation_3[0][0]               
__________________________________________________________________________________________________
stream_4 (Stream)               (256, 98, 1, 64)     1856        dropout_3[0][0]                  
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (256, 98, 1, 128)    8192        stream_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (256, 98, 1, 128)    512         conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (256, 98, 1, 128)    0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
dropout_4 (Dropout)             (256, 98, 1, 128)    0           activation_4[0][0]               
__________________________________________________________________________________________________
stream_5 (Stream)               (256, 98, 1, 128)    128         dropout_4[0][0]                  
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (256, 98, 1, 128)    16384       stream_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (256, 98, 1, 128)    512         conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (256, 98, 1, 128)    0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
dropout_5 (Dropout)             (256, 98, 1, 128)    0           activation_5[0][0]               
__________________________________________________________________________________________________
stream_6 (Stream)               (256, 128)           0           dropout_5[0][0]                  
__________________________________________________________________________________________________
flatten (Flatten)               (256, 128)           0           stream_6[0][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (256, 16)            2064        flatten[0][0]                    
==================================================================================================
Total params: 73,736
Trainable params: 72,200
Non-trainable params: 1,536
__________________________________________________________________________________________________