Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_audio (InputLayer)        [(1, 160)]           0                                            
__________________________________________________________________________________________________
speech_features (SpeechFeatures (1, 1, 40)           480         input_audio[0][0]                
__________________________________________________________________________________________________
tf_op_layer_ExpandDims (TensorF (1, 1, 1, 40)        0           speech_features[0][0]            
__________________________________________________________________________________________________
stream (Stream)                 (1, 1, 1, 40)        880         tf_op_layer_ExpandDims[0][0]     
__________________________________________________________________________________________________
conv2d (Conv2D)                 (1, 1, 1, 128)       5120        stream[0][0]                     
__________________________________________________________________________________________________
batch_normalization (BatchNorma (1, 1, 1, 128)       512         conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (1, 1, 1, 128)       0           batch_normalization[0][0]        
__________________________________________________________________________________________________
dropout (Dropout)               (1, 1, 1, 128)       0           activation[0][0]                 
__________________________________________________________________________________________________
stream_1 (Stream)               (1, 1, 1, 128)       3328        dropout[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (1, 1, 1, 64)        8192        stream_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (1, 1, 1, 64)        8192        dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (1, 1, 1, 64)        256         conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (1, 1, 1, 64)        256         conv2d_2[0][0]                   
__________________________________________________________________________________________________
add (Add)                       (1, 1, 1, 64)        0           batch_normalization_1[0][0]      
                                                                 batch_normalization_2[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (1, 1, 1, 64)        0           add[0][0]                        
__________________________________________________________________________________________________
dropout_1 (Dropout)             (1, 1, 1, 64)        0           activation_1[0][0]               
__________________________________________________________________________________________________
stream_2 (Stream)               (1, 1, 1, 64)        1920        dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (1, 1, 1, 64)        4096        stream_2[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (1, 1, 1, 64)        4096        dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (1, 1, 1, 64)        256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (1, 1, 1, 64)        256         conv2d_4[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (1, 1, 1, 64)        0           batch_normalization_3[0][0]      
                                                                 batch_normalization_4[0][0]      
__________________________________________________________________________________________________
activation_2 (Activation)       (1, 1, 1, 64)        0           add_1[0][0]                      
__________________________________________________________________________________________________
dropout_2 (Dropout)             (1, 1, 1, 64)        0           activation_2[0][0]               
__________________________________________________________________________________________________
stream_3 (Stream)               (1, 1, 1, 64)        2176        dropout_2[0][0]                  
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (1, 1, 1, 64)        4096        stream_3[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (1, 1, 1, 64)        4096        dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (1, 1, 1, 64)        256         conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (1, 1, 1, 64)        256         conv2d_6[0][0]                   
__________________________________________________________________________________________________
add_2 (Add)                     (1, 1, 1, 64)        0           batch_normalization_5[0][0]      
                                                                 batch_normalization_6[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (1, 1, 1, 64)        0           add_2[0][0]                      
__________________________________________________________________________________________________
dropout_3 (Dropout)             (1, 1, 1, 64)        0           activation_3[0][0]               
__________________________________________________________________________________________________
stream_4 (Stream)               (1, 1, 1, 64)        5504        dropout_3[0][0]                  
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (1, 1, 1, 128)       8192        stream_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (1, 1, 1, 128)       512         conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (1, 1, 1, 128)       0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
dropout_4 (Dropout)             (1, 1, 1, 128)       0           activation_4[0][0]               
__________________________________________________________________________________________________
stream_5 (Stream)               (1, 1, 1, 128)       256         dropout_4[0][0]                  
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (1, 1, 1, 128)       16384       stream_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (1, 1, 1, 128)       512         conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (1, 1, 1, 128)       0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
dropout_5 (Dropout)             (1, 1, 1, 128)       0           activation_5[0][0]               
__________________________________________________________________________________________________
stream_6 (Stream)               (1, 128)             12544       dropout_5[0][0]                  
__________________________________________________________________________________________________
flatten (Flatten)               (1, 128)             0           stream_6[0][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (1, 16)              2064        flatten[0][0]                    
==================================================================================================
Total params: 94,688
Trainable params: 72,200
Non-trainable params: 22,488
__________________________________________________________________________________________________